//////////////////////////////////////////////////////////////////////
//		Ќабор алгоритмов дл€ работы с растровыми изображени€ми
//		© BV и участники проекта, 2007 - 2013
//////////////////////////////////////////////////////////////////////

#pragma once

#include "EmptyFilter.h"

//Ёффекты
#include "Blur_OpenCL.h"
#include "AlphaBlend.h"

//TODO: ^^ добавл€йте новые эффекты сюда ^^

//“рансформаци€
#include "Shear.h"
#include "Waves.h"

//TODO: ^^ добавл€йте новые фильтры трансформации сюда ^^
